# QTCreateMovieRefID

```pascal
FUNCTION QTCreateMovieRefID : INTEGER;
```

```python
def vs.QTCreateMovieRefID():
    return INTEGER
```

## Examples
```pascal
resultN := QTCreateMovieRefID;
```
```python
import vs

resultN = vs.QTCreateMovieRefID()
vs.Message('QTCreateMovieRefID returned: ' + str(resultN))
```

## Version
Availability: from Vectorworks 2018

## Category
* Special - QuickTime